import sqlite3
import json

conn = sqlite3.connect("game.db")
cur = conn.cursor()

# ✅ правильная таблица (с lang!)
cur.execute("""
CREATE TABLE IF NOT EXISTS levels (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    difficulty TEXT,
    lang TEXT,
    grid TEXT,
    words TEXT
)
""")

# очистка (чтобы не было дублей)
cur.execute("DELETE FROM levels")

# ---------- ВСЕ УРОВНИ ----------
levels = [

    # RU
    ("easy", "ru",
     json.dumps([["К","О","Т"],["Р","А","К"],["Т","О","Р"]]),
     "КОТ,РАК"
    ),

    ("medium", "ru",
     json.dumps([
        ["П","О","К","О","Р","Д","Ю","Ш","Е","С"],
        ["З","Х","О","Ж","М","И","Ц","В","П","К"],
        ["Ш","Ц","К","Б","У","М","Й","Р","В","Г"],
        ["Й","К","А","Ж","Н","Ф","А","Н","Т","А"],
        ["В","Б","К","Й","П","Й","С","Н","И","Д"],
        ["Д","А","О","О","Т","И","С","П","Е","П"],
        ["К","С","Л","Л","У","Б","Д","Е","Р","М"],
        ["Г","Т","А","Р","Х","У","Н","Р","Г","Ш"],
        ["О","Д","У","В","А","Н","Ч","И","К","Е"],
        ["З","О","А","Д","А","Н","О","М","И","Л"],
        ]),
     "КОКАКОЛА,ЛИМОНАД,ОДУВАНЧИК,ТАРХУН,ФАНТА,СПРАЙТ,РЕДБУЛЛ,ДЮШЕС"
    ),
        ("medium", "ru",
     json.dumps([
        ["Р","А","Й","И","Щ","З","М","А","Р","С"],
        ["С","А","Р","М","Т","Х","Ш","М","Е","Н"],
        ["Н","Л","Ф","Б","И","Т","Н","С","И","И"],
        ["К","Ё","Д","А","Ю","Б","К","Ь","И","К"],
        ["Т","Н","Е","У","Э","И","А","Н","Д","Е"],
        ["Б","К","Д","Н","В","Л","Ь","Х","Ю","Р"],
        ["Ю","А","Ч","Т","Е","С","Л","З","Ц","С"],
        ["Ч","Ц","Й","И","Ф","И","Ф","О","Т","Э"],
        ["Г","В","Й","Э","В","И","К","Л","И","М"],
        ["И","Ч","У","П","А","Ч","У","П","С","Ы"],
        ]),
     "АЛЁНКА,ЧУПАЧУПС,МИЛКИВЭЙ,МАРС,СНИКЕРС,РАФАЭЛЛО,БАУНТИ,ТВИКС,ТОФИФИ"
    ),

    ("hard", "ru",
     json.dumps([
        ["Я","Й","Д","Ж","И","П","Ы","Б","М","Ц","П","Ю","Х"],
        ["А","Г","П","Р","Е","Г","М","Г","У","Е","М","Е","Ц"],
        ["Д","С","У","П","Л","В","Е","Т","Л","Э","Н","Г","Ш"],
        ["Ы","Р","Ь","А","Е","З","Р","У","О","Д","В","Е","Ч"],
        ["Б","Е","С","Э","Р","Г","С","А","А","Ч","Н","Д","С"],
        ["К","П","Р","К","М","А","Е","Й","Т","В","Э","Ч","Д"],
        ["О","У","М","Ф","О","Р","Д","Л","В","О","Г","Щ","Х"],
        ["И","К","А","З","С","Ш","Е","О","Е","В","Й","И","Э"],
        ["К","И","Б","С","И","Т","С","И","Ы","И","Д","О","С"],
        ["У","Н","А","Б","У","Г","А","Т","Т","И","Е","Ю","Т"],
        ["З","И","С","Ч","И","Ю","И","Р","Д","Б","И","Э","К"],
        ["У","М","Л","А","И","Р","Ш","У","О","Щ","Б","Д","Ж"],
        ["С","В","И","Н","Е","Г","А","В","Ц","Ь","Л","О","Ф"],
]),
     "МЕРСЕДЕС,ФОЛЬЦВАГЕН,БМВ,ХЕНДАЙ,БУГАТТИ,СУЗУКИ,ЯГУAР,ТОЙOТА,МИНИKУПEР,АУДИ,ДЖИП"
    ),

    # EN
    ("easy", "en",
     json.dumps([["C","A","T"],["D","O","G"],["R","A","T"]]),
     "CAT,DOG"
    ),

    ("medium", "en",
     json.dumps([
        ["R","N","J","D","C","P","O","R","H","N"],
        ["E","L","V","Q","O","K","J","U","L","T"],
        ["D","E","U","P","C","O","C","A","S","N"],
        ["B","M","D","T","A","R","H","U","N","S"],
        ["U","O","L","T","C","Y","O","F","P","r"],
        ["L","N","N","N","O","L","P","R","I","F"],
        ["L","A","S","D","L","B","I","J","S","H"],
        ["F","D","K","D","A","T","S","D","B","F"],
        ["U","E","U","S","E","H","S","U","Y","D"],
        ["K","I","H","C","N","A","V","U","D","O"],
     ]),
     "COCACOLA,LEMONADE,ODUVANCHIK,TARHUN,FANTA,SPRITE,REDBULL,DYUSHES"
    ),

    ("hard", "en",
     json.dumps([
        ["M","K","Q","T","B","U","G","A","T","T","I","O","P"],
        ["U","E","S","N","M","W","T","O","K","O","A","D","R"],
        ["I","X","R","J","W","W","D","O","W","Y","X","T","K"],
        ["C","I","A","S","F","I","P","I","S","O","P","I","R"],
        ["I","V","U","J","E","L","A","I","P","T","S","O","Z"],
        ["S","Y","G","H","X","D","Z","E","R","A","F","R","D"],
        ["M","I","A","P","N","Z","E","F","Q","S","A","P","I"],
        ["T","S","J","U","D","J","X","S","U","Z","U","K","I"],
        ["K","M","Y","M","R","O","P","M","R","Z","D","P","U"],
        ["S","H","L","R","V","L","M","K","O","Q","I","L","P"],
        ["N","V","O","L","K","S","W","A","G","E","N","P","P"],
        ["J","I","L","P","W","S","V","Q","I","C","J","K","U"],
        ["N","A","W","R","E","P","O","O","C","I","N","I","M"],
     ]),
     "MERCEDES,VOLKSWAGEN,BMW,HYUNDAI,BUGATTI,SUZUKI,JAGUAR,TOYOTA,MINICOOPER,AUDI,JEEP"
    ),
]

# вставка
cur.executemany(
    "INSERT INTO levels (difficulty, lang, grid, words) VALUES (?, ?, ?, ?)",
    levels
)

conn.commit()
conn.close()